In [1]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [3]:
df = pd.read_csv('taxi_zone_lookup.csv')

In [4]:
df

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                      NaN          NaN
264         265            NaN           Outside of NYC          NaN

[265 rows x 4 columns]

In [12]:
df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)

In [13]:
df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

In [6]:
from sqlalchemy import create_engine

In [7]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [8]:
engine.connect()

In [9]:
print(pd.io.sql.get_schema(df, name='yellow_taxi_data', con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" BIGINT,
	tpep_pickup_datetime TEXT,
	tpep_dropoff_datetime TEXT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	"RatecodeID" BIGINT,
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [16]:
df_iter = pd.read_csv('yellow_tripdata_2019-01.csv', iterator=True, chunksize=100000)

In [17]:
df_iter

In [21]:
df = next(df_iter)

In [37]:
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2019-01-01 00:46:40,2019-01-01 00:53:20,1,1.50,1,N,151,239,1,7.0,0.5,0.5,1.65,0.0,0.3,9.95,NaN
1,1,2019-01-01 00:59:47,2019-01-01 01:18:59,1,2.60,1,N,239,246,1,14.0,0.5,0.5,1.00,0.0,0.3,16.30,NaN
2,2,2018-12-21 13:48:30,2018-12-21 13:52:40,3,0.00,1,N,236,236,1,4.5,0.5,0.5,0.00,0.0,0.3,5.80,NaN
3,2,2018-11-28 15:52:25,2018-11-28 15:55:45,5,0.00,1,N,193,193,2,3.5,0.5,0.5,0.00,0.0,0.3,7.55,NaN
4,2,2018-11-28 15:56:57,2018-11-28 15:58:33,5,0.00,2,N,193,193,2,52.0,0.0,0.5,0.00,0.0,0.3,55.55,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,2,2019-01-01 13:43:31,2019-01-01 14:02:15,1,4.83,1,N,234,238,1,17.0,0.0,0.5,3.56,0.0,0.3,21.36,NaN
99996,1,2019-01-01 13:45:41,2019-01-01 13:51:12,4,1.10,1,N,230,186,2,6.0,0.0,0.5,0.00,0.0,0.3,6.80,NaN
99997,1,2019-01-01 13:52:57,2019-01-01 14:02:20,4,0.90,1,N,186,170,2,7.5,0.0,0.5,0.00,0.0,0.3,8.30,NaN
99998,2,2019-01-01 13:11:58,2019-01-01 13:16:56,5,1.72,1,N,107,229,2,7.0,0.0,0.5,0.00,0.0,0.3,7.80,NaN
99999,2,2019-01-01 13:20:35,2019-01-01 13:36:18,5,2.01,1,N,140,161,1,11.5,0.0,0.5,3.08,0.0,0.3,15.38,NaN

In [10]:
df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)
df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

In [11]:
df.head(0).to_sql(name='yellow_taxi_data', con=engine, if_exists='replace')

0

In [22]:
df.to_sql(name='yellow_taxi_data', con=engine, if_exists='append')

1000

In [12]:
from time import  time

In [13]:
df_iter = pd.read_csv('yellow_tripdata_2021-01.csv', iterator=True, chunksize=100000)

# Iterate through the dataset chunk by chunk
for chunk_number, df in enumerate(df_iter, start=1):
    time_start = time()

    # Convert datetime columns to the correct format
    df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
    df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

    # Insert the chunk into the SQL table
    df.to_sql(name='yellow_taxi_data', con=engine, if_exists='append')

    time_end = time()

    print(f'Inserted chunk {chunk_number}, took {time_end - time_start:.3f} seconds')

print("All data has been processed.")

Inserted chunk 1, took 10.142 seconds
Inserted chunk 2, took 9.515 seconds
Inserted chunk 3, took 9.439 seconds
Inserted chunk 4, took 9.657 seconds
Inserted chunk 5, took 9.570 seconds
Inserted chunk 6, took 9.472 seconds
Inserted chunk 7, took 9.481 seconds
Inserted chunk 8, took 9.388 seconds
Inserted chunk 9, took 9.587 seconds
Inserted chunk 10, took 9.743 seconds
Inserted chunk 11, took 9.631 seconds
Inserted chunk 12, took 9.666 seconds

/tmp/ipykernel_3334/1386251687.py:4: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  for chunk_number, df in enumerate(df_iter, start=1):

Inserted chunk 13, took 9.586 seconds
Inserted chunk 14, took 6.265 seconds
All data has been processed.